app/controllers/docxml_controller.rb

  def ver
    if not params[:format].nil? and params[:format] = "css"
      render :file => Rails.root +  "/public/stylesheets/#{params[:id]}.css"
      return
    end
    doc = Documento.find(params[:id]).xml
---
SELECT * FROM "documentos" WHERE ("documentos"."id" = 10430)