app/controllers/guias_controller.rb

  def hoja
    @guia = Guia.find(params[:id], :include => :copias, :joins => "LEFT JOIN documentos ON documentos.id = copias.documento_id" ,:order => "documentos.folio_opartes, copias.destinatario_id, copias.origen_id, copias.id")
---
SELECT * FROM "documentos" WHERE ("documentos"."id" = 1731)